Repository: gusrub/sw0rdfish-api
Catalog: app/Locale/*/LC_MESSAGES/messages.po
Languages: es

source: No environment set. Make sure that the SW0RDISH_ENV environment variable is set
es: No hay un entorno definido. Asegurate de que la variable de entorno SW0RDFISH este definida

source: Invalid filter: '{key}' is not a valid field
es: Filtro inválido: '{key}' no es un campo válido

source: {shortName} object has some invalid data
es: el objeto {shortName} contiene algunos datos inválidos

source: Property '{key}' does not exist in '{className}'
es: La propiedad '{key}' no existe en 'className'

source: No '{type}' validation exists
es: No existe una validación de tipo '{type}'

source: Error while counting records from '{tableName}'
es: Error al intentar contar registros de '{tableName}'

source: Error while loading records from '{tableName}'
es: Error al cargar registros de '{tableName}'

source: Error while getting record from '{tableName}' with ID '{id}'
es: Error al obtener registro de '{tableName}' con el ID '{id}'

source: Error while creating record in '{tableName}'
es: Error al crear registro en '{tableName}'

source: Error while updating record in '{tableName}' with ID '{id}'
es: Error al actualizar registro en '{tableName}' con el ID '{id}'

source: Error while deleting record from '{tableName}' with ID '{id}'
es: Error al eliminar registro de '{tableName}' con el ID '{id}'

source: Unknown driver '{dbDriver}', valid values are 'sqlite' and 'mysql'
es: Controlador '{dbDriver}' desconocido, valores válidos son 'sqlite' y 'mysql'

source: Object of type '{objectClass}' has no '{field}' property
es: El objeto de tipo '{objectClass}' no contiene una propiedad '{field}'

source: Expecting an instance of an object to validate against but none was given
es: Se esperaba la instancia de un objecto para validar en contra de pero ninguna se proporcionó

source: invalid email
es: correo inválido

source: Invalid options given for '{className}' validation, you must give an array with values to check against
es: Opciones inválidas para la validación de '{className}', debes proporcionar un arreglo con valores contra las cuales validar

source: value '{value}' not included in [{options}]
es: el valor '{value}' no está incluído en ['{options}']

source: Invalid options given for '{className}' validation, you can choose either greaterThan or greaterThanOrEqual but not both
es: Opciones inválidas para la validación de '{className}', puedes seleccionar greaterThan o greaterThanOrEqual pero no ambas

source: Invalid options given for '{className}' validation, you can choose either lessThan or lessThanOrEqual but not both
es: Opciones inválidas para la validación de '{className}', puedes seleccionar lessThan o lessThanOrEqual pero no ambas

source: Invalid options given for '{className}' validation: 'greaterThan' ({greaterThan}) cannot be greater or equal than 'lessThan' ({lessThan})
es: Opciones inválidas para la validación '{className}': '{lessThan}' no puede ser mayor o igual a '{greaterThan}'

source: Invalid options given for '{className}' validation: 'greaterThan' ({greaterThan}) cannot be greater than 'lessThanOrEqual' ({lessThanOrEqual})
es: Opciones inválidas para la validación '{className}': '{lessThan}' no puede ser mayor a '{greaterThan}'

source: Invalid options given for '{className}' validation: 'greaterThanOrEqual' ({greaterThanOrEqual}) cannot be greater than 'lessThan' ({lessThan})
es: Opciones inválidas para la validación '{className}': 'greaterThanOrEqual' ({greaterThanOrEqual}) no puede ser mayor a 'lessThan' ({greaterThan})

source: Invalid options given for '{className}' validation: 'greaterThanOrEqual' ({greaterThanOrEqual}) cannot be greater than 'lessThanOrEqual' ({lessThanOrEqual})
es: Opciones inválidas para la validación '{className}': 'greaterThanOrEqual' ({greaterThanOrEqual}) no puede ser mayor a 'lessThanOrEqual' ({lessThanOrEqual})

source: value '{value}' is not a valid number
es: el valor '{value}' no es un número válido

source: must be greater than '{greaterThan}'
es: debe ser mayor a '{greaterThan}'

source: must be greater than or equal to '{greaterThanOrEqual}'
es: debe ser mayor que o igual a '{greaterThanOrEqual}'

source: must be less than '{lessThan}'
es: debe ser menor a '{lessThan}'

source: must be less than or equal to '{lessThanOrEqual}'
es: debe ser menor o igual a '{lessThanOrEqual}'

source: cannot be empty
es: no puede estar vacío

source: Invalid options given for '{type}' validation. Valid options are: '{validations}'
es: Opciones inválidas para la validación de '{className}', debes proporcionar un arreglo con valores contra las cuales validar

source: field '{field}' is scoped to '{scope}' but it is empty
es: el campo '{field}' está combinado con '{scope}' pero está vacío

source: duplicate value found for '{field}'
es: valor duplicado encontrado en '{field}'

source: This is an API application. Nothing to see here!
es: Esta es una aplicación de tipo API. No hay nada que ver aquí!

source: TEST: this string should be translated!
es: PRUEBA: esta cadena de texto debería estar traducida!

source: TEST: Hello {name}, you are {years} years old!
es: PRUEBA: Hola {name}, tienes {years} años!
